rainer20512/stm32-fw/common/src/dev/adc_dev.c
/*
 ******************************************************************************
 * @file    adc_dev.c 
 * @author  Rainer
 * @brief   ADC hardware wrapped into device type
 *
 *****************************************************************************/

/** @addtogroup ADC device
  * @{
  */

#include "config/devices_config.h"

#if defined(USE_ADC1) || defined(USE_ADC2) || defined(USE_ADC3)

#include "error.h"
#include "dev/hw_device.h"
#include "system/hw_util.h"
#include "system/dma_handler.h"

#include "dev/devices.h"
#include "config/adc_config.h"
#include "task/minitask.h"
#include "system/periodic.h"


#define DEBUG_ADC 1

#if DEBUG_MODE > 0 && DEBUG_ADC > 0
    #include "debug_helper.h"
    #include "system/profiling.h"
#else
    #include <stdio.h>
#endif

#if defined(STM32L476xx) || defined(STM32L496xx) || defined(STM32L4Sxxx)
    #define ADC_SAMPLETIME_FAST     ADC_SAMPLETIME_24CYCLES_5
    #define ADC_SAMPLETIME_SLOW     ADC_SAMPLETIME_47CYCLES_5
    #define ADC_CLOCKSOURCE         RCC_ADCCLKSOURCE_SYSCLK
#elif defined(STM32H747xx) || defined(STM32H745xx) || defined(STM32H742xx) || defined(STM32H743xx)
    #define ADC_SAMPLETIME_FAST     ADC_SAMPLETIME_32CYCLES_5
    #define ADC_SAMPLETIME_SLOW     ADC_SAMPLETIME_64CYCLES_5
    #define ADC_CLOCKSOURCE         RCC_ADCCLKSOURCE_CLKP
#else
    #error "No setup for ADC sample times"
#endif

/* My defines -------------------------------------------------------------------*/
/* Size of requierd DMA buffer for max 8 DMA channels, MUST reside in noncached area! */
#define ADC_DMABUF_SIZE         17

/* My macros --------------------------------------------------------------------*/
#define GET_SEQ_LEN(hadc)       ( ( hadc->Instance->SQR1 & ADC_SQR1_L_Msk ) + 1 )

/* Public typedef ---------------------------------------------------------------*/


typedef struct {
     AdcHandleT *myAdcHandle;       /* Ptr to my associated handle */
     uint16_t   *myDmaBuf;          /* Ptr to associated dmabuf    */
} ADC_AdditionalDataType;


/* Forward declarations -------------------------------------------------------------*/

static ADC_AdditionalDataType * ADC_GetAdditionalData(const HW_DeviceType *self)
{
    return (ADC_AdditionalDataType *)(self->devData);
}



/* Private or driver functions ------------------------------------------------------*/

/******************************************************************************
 * Check for driver being initialized 
 *****************************************************************************/
static bool Adc_AssertInitialized(const HW_DeviceType *self)
{
    ADC_AdditionalDataType *adt = ADC_GetAdditionalData(self);
    #if DEBUG_MODE > 0 && DEBUG_ADC > 0
        if (!adt->myAdcHandle->bInitialized ) DEBUG_PRINTF("Error: %s not initialized\n", self->devName);
    #endif
    return adt->myAdcHandle->bInitialized;
}

/******************************************************************************
 * Check for driver being initialized 
 *****************************************************************************/
static bool Adc_AssertRefint(const HW_DeviceType *self)
{
    bool ret = ADC_HAS_REFINT(self->devBase);
    #if DEBUG_MODE > 0 && DEBUG_ADC > 0
        if (!ret ) DEBUG_PRINTF("Error: %s has no Refint capability\n", self->devName);
    #endif
    return ret;
}

/******************************************************************************
 * Check for driver being initialized 
 *****************************************************************************/
static bool Adc_AssertChiptemp(const HW_DeviceType *self)
{
    bool ret = ADC_HAS_CHIPTEMP(self->devBase);
    #if DEBUG_MODE > 0 && DEBUG_ADC > 0
        if (!ret ) DEBUG_PRINTF("Error: %s has no Chip temp capability\n", self->devName);
    #endif
    return ret;
}


/******************************************************************************
 * Setup the ADC_InitTypeDef structure for 
 * - 12 bit resolution, 16x oversampling, right aligned result, 
 * - ADC start by software, number of sequencer channels as specified,
 * - EOC at end of sequence,
 * 0 on failure 
 *****************************************************************************/
static bool Adc_SetupInit(const HW_DeviceType *self, uint8_t nrofChannels )
{
    ADC_AdditionalDataType *adt = ADC_GetAdditionalData(self);
    ADC_HandleTypeDef *hAdc     = &adt->myAdcHandle->hAdc;
    ADC_InitTypeDef *Init       = &hAdc->Init;
    ADC_OversamplingTypeDef *o  = &Init->Oversampling;


    /* 
     * Do the neccessary ADC settings. Theses settings are done only once and are kept 
     * in Init-Struct as long as the variable is in scope.
     */
    Init->Resolution            = ADC_RESOLUTION_12B;               /* 12-bit resolution for converted data */
    Init->OversamplingMode      = ENABLE;                           /* enable oversampling */
    #if defined(STM32L476xx) || defined(STM32L496xx) || defined(STM32L4Sxxx)
        Init->ClockPrescaler        = ADC_CLOCK_SYNC_PCLK_DIV1;         /* Synchronous clock mode, input ADC clock divided by 2*/
        Init->DataAlign             = ADC_DATAALIGN_RIGHT;              /* Right-alignment for converted data */
        Init->DMAContinuousRequests = DISABLE;                          /* ADC DMA for only one sequence */
        o->Ratio                    = ADC_OVERSAMPLING_RATIO_16;        /* 16x oversampling */
        o->RightBitShift            = ADC_RIGHTBITSHIFT_4;              /* shift result, so we have again a 12bit result after oversampling */
    #elif defined(STM32H747xx) || defined(STM32H745xx) || defined(STM32H742xx) || defined(STM32H743xx)
        Init->ClockPrescaler        = ADC_CLOCK_ASYNC_DIV16;         /* Peripheral clock of 64 MHz divied by 16*/
        o->Ratio                    = 16;                               /* 16x oversampling */
        o->RightBitShift            = ADC_RIGHTBITSHIFT_4;              /* shift result, so we have again a 12bit result after oversampling */
        if ( nrofChannels < 2 ) 
            Init->ConversionDataManagement = ADC_CONVERSIONDATA_DR  ;       /* ADC Data register of inly one channel */
        else
            Init->ConversionDataManagement = ADC_CONVERSIONDATA_DMA_ONESHOT;/* ADC DMA for only one sequence */
    #else
        #error "NO ADC setup for selected STM32 type"
    #endif
    if ( nrofChannels < 2 ) {
        Init->ScanConvMode          = DISABLE;                   /* Sequencer disabled, only one channel */
        Init->EOCSelection          = ADC_EOC_SINGLE_CONV;       /* EOC flag picked-up to indicate end of one conversion */
        adt->myAdcHandle->bSequence = false;                     /* remember that we configured single channel */   
    } else {
        Init->ScanConvMode          = ENABLE;                    /* Sequencer enabled  when more than one channel */
        Init->EOCSelection          = ADC_EOC_SEQ_CONV;          /* EOC flag picked-up to indicate end of whole sequence */
        adt->myAdcHandle->bSequence = true;                      /* remember that we configured a sequence */ 
   }
    Init->LowPowerAutoWait      = DISABLE;                       /* Auto-delayed conversion feature disabled */
    Init->ContinuousConvMode    = DISABLE;                       /* Continuous mode disabled (one shot conversion) */
    Init->NbrOfConversion       = nrofChannels;                  /* As passed */
    Init->DiscontinuousConvMode = DISABLE;                       /* Parameter discarded because continuous mode is disabled */
    Init->NbrOfDiscConversion   = 1;                             /* Parameter discarded because sequencer is disabled */
    Init->ExternalTrigConv      = ADC_SOFTWARE_START;            /* Software start to trig the 1st conversion manually, without external event */
    Init->ExternalTrigConvEdge  = ADC_EXTERNALTRIGCONVEDGE_NONE; /* Parameter discarded because software trigger chosen */
    Init->Overrun               = ADC_OVR_DATA_OVERWRITTEN;      /* DR register is overwritten with the last conversion result in case of overrun */

    o->OversamplingStopReset    = ADC_REGOVERSAMPLING_CONTINUED_MODE;   /* Preserve Oversampling buffer during injected conversions */
    o->TriggeredMode            = ADC_TRIGGEREDMODE_SINGLE_TRIGGER;     /* All samples done in one step */

