rainer20512/stm32-fw/common/src/dev/adc_dev.c
    /* Initialize ADC peripheral according to the passed parameters */
    if (HAL_ADC_Init(hAdc) != HAL_OK) {
        #if DEBUG_MODE > 0 && DEBUG_ADC > 0 
            DEBUG_PRINTF("Init of %s failed\n", self->devName);
        #endif
        return false;
    } 

    return true;
}
/******************************************************************************
 * Return the Rank bitmask for Rank idx
 * 0 on failure 
 *****************************************************************************/
static uint32_t Adc_GetRankFromIdx( uint32_t idx )
{
    static const uint32_t ADC_ranks[] = { 
        ADC_REGULAR_RANK_1,  ADC_REGULAR_RANK_2,  ADC_REGULAR_RANK_3,  ADC_REGULAR_RANK_4,
        ADC_REGULAR_RANK_5,  ADC_REGULAR_RANK_6,  ADC_REGULAR_RANK_7,  ADC_REGULAR_RANK_8,
        ADC_REGULAR_RANK_9,  ADC_REGULAR_RANK_10, ADC_REGULAR_RANK_11, ADC_REGULAR_RANK_12,
        ADC_REGULAR_RANK_13, ADC_REGULAR_RANK_14, ADC_REGULAR_RANK_15, ADC_REGULAR_RANK_16,
    };
    
    idx--;

    if ( idx > sizeof(ADC_ranks)/sizeof(uint32_t) ) 
        return 0;
    else
        return ADC_ranks[idx];
}

/******************************************************************************
 * Setup a channel with Rank1 for Vrefint conversion
 * caller has to make sure, that associated ADC has an refint channel!
 *****************************************************************************/
 static void Adc_SetupVrefintChannel(ADC_ChannelConfTypeDef *c, uint32_t rankidx) 
{
    c->Channel      = ADC_CHANNEL_VREFINT;         /* Internal Vrefint channel ( only valid for certain ADC instances ) */
    c->Rank         = Adc_GetRankFromIdx(rankidx); /* Rank of sampled channel number ADCx_CHANNEL */
    c->SamplingTime = ADC_SAMPLETIME_SLOW;         /* Sampling time (number of clock cycles unit), according to datasheet: minimum 4uS */
    c->SingleDiff   = ADC_SINGLE_ENDED;            /* Single-ended input channel */
    c->OffsetNumber = ADC_OFFSET_NONE;             /* No offset subtraction */ 
    c->Offset       = 0;                           /* Parameter discarded because offset correction is disabled */
}

/**************************************************************************************
 * Start a single conversion 
 * ADC must have been initialized for one channel
 * and the channel must have been configured before
 *************************************************************************************/
static bool ADC_SingleConversion(ADC_HandleTypeDef *hAdc, uint32_t *raw )
{
    bool ret = true;
    /* Start conversion  */
    if (HAL_ADC_Start(hAdc) != HAL_OK) {
        #if DEBUG_MODE > 0 && DEBUG_ADC > 0 
            DEBUG_PUTS("ADC_Start failed");
        #endif
        return false;
    }
  
    /* Wait for conversion being done */
    if (HAL_ADC_PollForConversion(hAdc, 10) != HAL_OK) {
        #if DEBUG_MODE > 0 && DEBUG_ADC > 0 
            DEBUG_PUTS("ADC Polling failed");
        #endif
        ret = false;
        goto single_end;
    }

    /* Read the converted value and convert to mV by HAL macro*/
    *raw = HAL_ADC_GetValue(hAdc);

single_end:
    HAL_ADC_Stop(hAdc);
    return ret;
}

static void AdcDmaChannelInit(AdcHandleT *myAdc, const HW_DmaType *dma )
{

  DMA_HandleTypeDef *hdma = dma->dmaHandle;

  HW_DMA_HandleInit(hdma, dma, &myAdc->hAdc );

  /* Overwrite Data alignment, which is initialized to 'byte' */
  hdma->Init.PeriphDataAlignment = DMA_PDATAALIGN_HALFWORD;
  hdma->Init.MemDataAlignment    = DMA_MDATAALIGN_HALFWORD;
  
  hdma->Init.Direction           = DMA_PERIPH_TO_MEMORY;  
  
  myAdc->hAdc.DMA_Handle     = dma->dmaHandle;

  HAL_DMA_Init(hdma);

  return;
}

static void Adc_UpdateVdda( AdcHandleT *myAdcHandle, uint32_t raw_result )
{
    ADC_HandleTypeDef *hAdc  = &myAdcHandle->hAdc;
    myAdcHandle->vdda        = __HAL_ADC_CALC_VREFANALOG_VOLTAGE( raw_result, hAdc->Init.Resolution );
    myAdcHandle->bVdda_valid = true;
    #if DEBUG_MODE > 0 && DEBUG_ADC > 0 
        DEBUG_PRINTF("Vdda=%dmV\n", myAdcHandle->vdda);
    #endif
}

static AdcHandleT *Adc_GetMyHandleFromHalHandle(ADC_HandleTypeDef *hadc)
{
#if defined(ADC1) && defined(USE_ADC1)
    if ( &ADC1Handle.hAdc == hadc ) return &ADC1Handle;
#endif
#if defined(ADC2) && defined(USE_ADC2)
    if ( &ADC2Handle.hAdc == hadc ) return &ADC2Handle;
#endif
#if defined(ADC3) && defined(USE_ADC3)
    if ( &ADC3Handle.hAdc == hadc ) return &ADC3Handle;
#endif
    return NULL;
}

/* Interrupt Callbacks, executed in interrupt context --------------------------------*/

/**************************************************************************************
 * Callback for "Conversion of sequence complete"
 * Inform the task scheduler, that ADC actions have to be taken
 *
 * Moreover, if Refint capability is availabel, it has been added as first channel:
 * As we added measurement of Vrefint in the first position, we will reomve the first
 * result from the sequence here and use it to update the Vdda value
 * 
 * 
 *************************************************************************************/
void HAL_ADC_ConvCpltCallback (ADC_HandleTypeDef *hadc)
{   
    #if DEBUG_MODE > 0 && DEBUG_ADC > 0 && DEBUG_PROFILING > 0
        DEBUG_PRINTF("%d>",ProfilerGetMicrosecond());
    #endif

    HAL_ADC_Stop_DMA(hadc);
    AdcHandleT *myHandle = Adc_GetMyHandleFromHalHandle(hadc);
    if (!myHandle ) return;

    uint8_t seqlen = GET_SEQ_LEN(hadc);
    if ( ADC_HAS_REFINT(hadc->Instance) ) {
        uint32_t raw = myHandle->dmabuf[0];
        Adc_UpdateVdda(myHandle, raw);
        myHandle->seqLen = seqlen-1;
        myHandle->seqResultPtr = myHandle->dmabuf+1;
    } else {
        myHandle->seqLen = seqlen;
        myHandle->seqResultPtr = myHandle->dmabuf;
    }

    myHandle->bSequenceDone = true;
    TaskNotify(TASK_ADC);
}

void HAL_ADC_ErrorCallback (ADC_HandleTypeDef * hadc)
{   
    puts("error");
    HAL_ADC_Stop_DMA(hadc);
}



/* Public or driver functions --------------------------------------------------------*/

/**************************************************************************************
 * Retun the result of the latest Vdda measurement
 * conversions may be performed
 *************************************************************************************/
uint16_t ADC_GetVdda(const HW_DeviceType *self)
{
    ADC_AdditionalDataType *adt = ADC_GetAdditionalData(self);
    AdcHandleT *myAdcHandle     = adt->myAdcHandle;
    if (myAdcHandle->bVdda_valid)
        return myAdcHandle->vdda;
    else
        return 0;
}    

#if defined(STM32L476xx) || defined(STM32L496xx) || defined(STM32L4Sxxx)
static inline __attribute__((always_inline))
bool AdcCalibrate ( ADC_HandleTypeDef *hAdc )
{
  return    
       (HAL_ADCEx_Calibration_Start(hAdc, ADC_SINGLE_ENDED      ) ==  HAL_OK) 
    && (HAL_ADCEx_Calibration_Start(hAdc, ADC_DIFFERENTIAL_ENDED) ==  HAL_OK)
  ;
}
#elif defined(STM32H747xx) || defined(STM32H745xx) || defined(STM32H742xx) || defined(STM32H743xx)
bool AdcCalibrate ( ADC_HandleTypeDef *hAdc )
{
  return    
       (HAL_ADCEx_Calibration_Start(hAdc, ADC_CALIB_OFFSET,           ADC_SINGLE_ENDED      ) ==  HAL_OK) 
    && (HAL_ADCEx_Calibration_Start(hAdc, ADC_CALIB_OFFSET_LINEARITY, ADC_SINGLE_ENDED      ) ==  HAL_OK)
    && (HAL_ADCEx_Calibration_Start(hAdc, ADC_CALIB_OFFSET,           ADC_DIFFERENTIAL_ENDED) ==  HAL_OK)
    && (HAL_ADCEx_Calibration_Start(hAdc, ADC_CALIB_OFFSET_LINEARITY, ADC_DIFFERENTIAL_ENDED) ==  HAL_OK)
  ;
}
#else
    #error "No ADC calibration preocedure defined"
#endif

/**************************************************************************************
 * Do an ADC calibration. This is mandatory as rthe first step before any other
 * conversions may be performed
 *************************************************************************************/
bool ADC_Calibrate(const HW_DeviceType *self)
{
    /* make sure that the handle is initialized */
    if (!Adc_AssertInitialized(self) ) return false;

    ADC_AdditionalDataType *adt = ADC_GetAdditionalData(self);
    ADC_HandleTypeDef *hAdc     = &adt->myAdcHandle->hAdc;

    /* Setup for one channel, mandatory before conversion */
    Adc_SetupInit(self, 1);

    /* Wait for ADC voltage sources to stablize */
    HAL_Delay(LL_ADC_DELAY_INTERNAL_REGUL_STAB_US);

    /* do the mandatory ADC Calibration, MUST be done after ADC_Init! */
    if (  !AdcCalibrate(hAdc) ) {
        #if DEBUG_MODE > 0 && DEBUG_ADC > 0 
            DEBUG_PRINTF("Calibration of %s failed\n", self->devName);
        #endif
        return false;
    }
    /* Store both calibration factors */
    adt->myAdcHandle->adc_calfact = hAdc->Instance->CALFACT;
    return true;
}
 

