rainer20512/stm32-fw/common/src/dev/adc_dev.c
/******************************************************************************
 * Measure a single channel. The parameter channel_idx refers to the
 * "channel_idx"-th channel in the gpio list of the device
 *****************************************************************************/
uint32_t ADC_MeasureChannel ( const HW_DeviceType *self, uint32_t channel_idx )
{
    /* make sure that the handle is initialized */
    if (!Adc_AssertInitialized(self) ) return 0xFFFFFFFF;

    ADC_AdditionalDataType *adt         = ADC_GetAdditionalData(self);
    ADC_HandleTypeDef *hAdc             = &adt->myAdcHandle->hAdc;
    const HW_GpioList_ADC *gpioadclist  = self->devGpioADC;

    const HW_Gpio_ADC_Type *gpio;
    ADC_ChannelConfTypeDef c;  
    uint32_t raw;

    if ( channel_idx >= gpioadclist->num ) {
        #if DEBUG_MODE > 0 && DEBUG_ADC > 0 
            DEBUG_PRINTF("Channel %d not configured for %s\n", channel_idx, self->devName);
        #endif
        return 0xFFFFFFFF;
    }

    /* Check for single channel being initialized */
    if ( adt->myAdcHandle->bSequence ) Adc_SetupInit(self, 1);

    gpio           = &gpioadclist->gpio[channel_idx];
    c.OffsetNumber = ADC_OFFSET_NONE;                           /* No offset subtraction */ 
    c.Offset       = 0;                                         /* Parameter discarded because offset correction is disabled */
    c.SingleDiff   = ADC_SINGLE_ENDED;                          /* Single-ended input channel */
    c.Channel      = gpio->channelID;                           /* Channel ID as configured */
    c.Rank         = Adc_GetRankFromIdx(1);                     /* Rank in sequence of definition */
    c.SamplingTime = gpio->sampleTime;                          /* Sample time as configured */

    if (HAL_ADC_ConfigChannel(hAdc, &c) != HAL_OK) {
        #if DEBUG_MODE > 0 && DEBUG_ADC > 0 
            DEBUG_PRINTF("unable to configure channel %d of %s\n",channel_idx, self->devName);
        #endif
        return 0xFFFFFFFF;
    } 

    if ( !ADC_SingleConversion(hAdc, &raw) ) return 0xFFFFFFFF;
    #if DEBUG_MODE > 0 && DEBUG_ADC > 0 
        DEBUG_PRINTF("Raw value of Ch %d is %d\n", channel_idx, raw);
    #endif
    return raw;
}

/**************************************************************************************
 * Do an ADC conversion of Vrefint to compute Vdda, which is also Vref
 * Then Vref is stored internally 
 *************************************************************************************/
static bool Adc_MeasureVdda (const HW_DeviceType *self)
{
    /* make sure that the handle is initialized */
    if (!Adc_AssertInitialized(self) ) return false;

    /* make sure that the ADXC has a REFINT channel */
    if (!Adc_AssertRefint(self) ) return false;

    ADC_AdditionalDataType *adt = ADC_GetAdditionalData(self);
    ADC_HandleTypeDef *hAdc     = &adt->myAdcHandle->hAdc;
    uint32_t raw;

    /* Vrefint can be measured via specific only */
    if ( !ADC_HAS_REFINT(self->devBase) ) return false;

    /* Check for single channel being initialized */
    if ( adt->myAdcHandle->bSequence ) Adc_SetupInit(self, 1);

    ADC_ChannelConfTypeDef c;  
    Adc_SetupVrefintChannel(&c,1);

    /* Configure channel */
    if (HAL_ADC_ConfigChannel(hAdc, &c) != HAL_OK) {
        #if DEBUG_MODE > 0 && DEBUG_ADC > 0 
            DEBUG_PUTS("Failed to configure Vrefint-Channel");
        #endif
        return false;
    }
    HAL_Delay(LL_ADC_DELAY_VREFINT_STAB_US);
      
    if ( !ADC_SingleConversion(hAdc, &raw) ) return false;
 
    Adc_UpdateVdda( adt->myAdcHandle, raw );
    return true;
}

static inline __attribute__((always_inline))
ADC_Common_TypeDef *GetCommonInstance(const HW_DeviceType *self)
{
    UNUSED(self);
    #if defined(STM32L476xx) || defined(STM32L496xx) || defined(STM32L4Sxxx)
        return __LL_ADC_COMMON_INSTANCE(self->devBase);
    #elif defined(STM32H747xx) || defined(STM32H745xx) || defined(STM32H742xx) || defined(STM32H743xx)
        return __LL_ADC_COMMON_INSTANCE(self->devBase);
    #else
        #error "No implementation to determine ADC common instance"
    #endif
}

void ADC_DisableRefintCh(const HW_DeviceType *self)
{
    CLEAR_BIT(GetCommonInstance(self)->CCR, ADC_CCR_VREFEN );
}

void ADC_DisableAllInternalCh(const HW_DeviceType *self)
{
    CLEAR_BIT(GetCommonInstance(self)->CCR, ADC_CCR_VREFEN | ADC_CCR_TSEN | ADC_CCR_VBATEN );
}


bool ADC_MeasureChipTemp (const HW_DeviceType *self)
{
    /* make sure that the handle is initialized */
    if (!Adc_AssertInitialized(self) ) return false;

    /* make sure that the ADC is capable of measuring Chip temp */
    if (!Adc_AssertChiptemp(self) ) return false;

    ADC_AdditionalDataType *adt = ADC_GetAdditionalData(self);
    ADC_HandleTypeDef *hAdc     = &adt->myAdcHandle->hAdc;
    uint32_t raw;

    /* Check for single channel being initialized */
    if ( adt->myAdcHandle->bSequence ) Adc_SetupInit(self, 1);
    
    ADC_ChannelConfTypeDef c;  
    c.Channel      = ADC_CHANNEL_TEMPSENSOR;      /* Internal TempSensor ch. ( valid for certain channels ) */
    c.Rank         = ADC_REGULAR_RANK_1;          /* Rank of sampled channel number ADCx_CHANNEL */
    c.SamplingTime = ADC_SAMPLETIME_FAST;         /* Sampling time (number of clock cycles unit) */
    c.SingleDiff   = ADC_SINGLE_ENDED;            /* Single-ended input channel */
    c.OffsetNumber = ADC_OFFSET_NONE;             /* No offset subtraction */ 
    c.Offset       = 0;                           /* Parameter discarded because offset correction is disabled */

    /* Configure channel */
    if (HAL_ADC_ConfigChannel(hAdc, &c) != HAL_OK) {
        #if DEBUG_MODE > 0 && DEBUG_ADC > 0 
            DEBUG_PUTS("Failed to configure TempSensor-Channel");
        #endif
        return false;
    }
  
    #if DEBUG_MODE > 0 && DEBUG_ADC > 0 && DEBUG_PROFILING > 0
        DEBUG_PRINTF(">%d",ProfilerGetMicrosecond());
    #endif
    
    if ( !ADC_SingleConversion(hAdc, &raw) ) return false;
    
