rainer20512/stm32-fw/common/src/dev/adc_dev.c
    #if DEBUG_MODE > 0 && DEBUG_ADC > 0 && DEBUG_PROFILING > 0 
        DEBUG_PRINTF(",%d>\n",ProfilerGetMicrosecond());
    #endif

    adt->myAdcHandle->chiptemp  = __HAL_ADC_CALC_TEMPERATURE(adt->myAdcHandle->vdda, raw, ADC_RESOLUTION_12B );
    #if DEBUG_MODE > 0 && DEBUG_ADC > 0 
        DEBUG_PRINTF("Chiptemp=%d degC\n", adt->myAdcHandle->chiptemp);
    #endif
    return true;
}

/******************************************************************************
 * Put all defined channels for tha ADC in one big channel group
 *****************************************************************************/
void ADC_SetupGroup (const HW_DeviceType *self)
{
    /* make sure that the handle is initialized */
    if (!Adc_AssertInitialized(self) ) return;

    ADC_AdditionalDataType *adt         = ADC_GetAdditionalData(self);
    ADC_HandleTypeDef *hAdc             = &adt->myAdcHandle->hAdc;
    const HW_GpioList_ADC *gpioadclist  = self->devGpioADC;
    const HW_Gpio_ADC_Type *gpio;

    ADC_ChannelConfTypeDef c;  
    uint32_t rank = 1;
    uint32_t i = 0;

    /* Make sure, that DMA is supported, it won't work without */
    if ( !self->devDmaRx ) {
        #if DEBUG_MODE > 0 && DEBUG_ADC > 0 
            DEBUG_PRINTF("Converting sequences requires DMA to be configured");
        #endif
        return;
    }

    uint8_t nrofch = gpioadclist->num; 

    /* if Instance has Refint channel, it is always inserted as the first channel */
    if ( ADC_HAS_REFINT(hAdc->Instance) ) nrofch++;
    Adc_SetupInit(self, nrofch);

    /* if Instance has Refint channel, it is always inserted as the first channel */
    if ( ADC_HAS_REFINT(hAdc->Instance) ) {
        Adc_SetupVrefintChannel(&c, rank);
        /* Configure channel */
        if (HAL_ADC_ConfigChannel(hAdc, &c) != HAL_OK) {
            #if DEBUG_MODE > 0 && DEBUG_ADC > 0 
                DEBUG_PUTS("Failed to configure Vrefint-Channel");
            #endif
        } else {
            rank++;
        }
    }

    /* Now process all other channels */
    /* We only support single ended with no offset */
    c.OffsetNumber = ADC_OFFSET_NONE;                           /* No offset subtraction */ 
    c.Offset       = 0;                                         /* Parameter discarded because offset correction is disabled */
    c.SingleDiff   = ADC_SINGLE_ENDED;                          /* Single-ended input channel */

    while ( i < gpioadclist->num && rank <= 16 ) {
        gpio           = &gpioadclist->gpio[i];
        c.Channel      = gpio->channelID;                       /* Channel ID as configured */
        c.Rank         = Adc_GetRankFromIdx(rank);              /* Rank in sequence of definition */
        c.SamplingTime = gpio->sampleTime;                      /* Sample time as configured */
        if (HAL_ADC_ConfigChannel(hAdc, &c) != HAL_OK) {
            #if DEBUG_MODE > 0 && DEBUG_ADC > 0 
                DEBUG_PRINTF("unable to configure channel %d of %s\n",i, self->devName);
            #endif
        } else {
            rank++;
        }
        i++;
    }
}

bool ADC_MeasureGroup(const HW_DeviceType *self)
{
    /* make sure that the handle is initialized */
    if (!Adc_AssertInitialized(self) ) return false;

    ADC_AdditionalDataType *adt = ADC_GetAdditionalData(self);
    ADC_HandleTypeDef *hAdc     = &adt->myAdcHandle->hAdc;

    if ( !adt->myAdcHandle->bSequence ) {
        #if DEBUG_MODE > 0 && DEBUG_ADC > 0 
            DEBUG_PUTS("MeasureGroup: No Sequence configured");
        #endif
        return false;
    }
  
    /* Invalidate old results */
    adt->myAdcHandle->bSequenceDone = false;
    #if DEBUG_MODE > 0 && DEBUG_ADC > 0 && DEBUG_PROFILING > 0 
        DEBUG_PRINTF(">%d",ProfilerGetMicrosecond());
    #endif
    uint32_t length = GET_SEQ_LEN(hAdc);
    /* Start conversion  */
    if (HAL_ADC_Start_DMA(hAdc, (uint32_t *)adt->myAdcHandle->dmabuf, length ) != HAL_OK) {
        #if DEBUG_MODE > 0 && DEBUG_ADC > 0 
            DEBUG_PUTS("Measuring Via DMA failed");
        #endif
        return false;
    }

    return true;

}

/* 
 * There is one clocksource, that is common to all ADCs.
 * currently, we only support SYSCLK as clocksoure. This is configured  once
 * at this point

 */
static void ADC_ClockInit (const HW_DeviceType *self, bool bIsInit)
{
    /* Set clock source */
    if ( bIsInit ) {
      __HAL_RCC_ADC_CONFIG(ADC_CLOCKSOURCE);
    }

    /* enable ADC clock */
    HW_SetHWClock((void *)self->devBase, 1);

}




bool ADC_Init(const HW_DeviceType *self)
{
    ADC_AdditionalDataType *adt     = ADC_GetAdditionalData(self);
    AdcHandleT *myHandle            = adt->myAdcHandle;  
    ADC_HandleTypeDef *hAdc         = &myHandle->hAdc;
    hAdc->Instance                  = (ADC_TypeDef *)self->devBase;

    myHandle->bVdda_valid   = false;
    myHandle->bSequence     = false;
    myHandle->dmabuf        = adt->myDmaBuf;
  
    ADC_ClockInit(self, true);

    uint32_t devIdx = GetDevIdx(self);
    GpioADCInitAll(devIdx, self->devGpioADC);

    /* DeInit before Init */
    if (HAL_ADC_DeInit(hAdc) != HAL_OK) {
        #if DEBUG_MODE > 0 && DEBUG_ADC > 0 
            DEBUG_PRINTF("DeInit before Init of %s failed\n", self->devName);
        #endif
        return false;
    }

    if ( !Adc_SetupInit(self, 1 ) ) return false;

    /* 
     * Do the mandatory calibration, or in case of ADC1
     * do the calibration & sample of Vrefint in order to 
     * determine Vdda ( which is also Vref+ ) 
     * Calibration will also init ADC for one channel, 
     * no sequence, no injected channels 
     */
    myHandle->bInitialized  = true;
    if (!ADC_Calibrate(self) ) {
        myHandle->bInitialized  = false;
        return false;
    }
    
    if ( ADC_HAS_REFINT(self->devBase) ) ADC_MeasureVdda((void *)self);


    /* Configure the NVIC, enable interrupts */
    HW_SetAllIRQs(self->devIrqList, true);

    /* Enable DMA, if specified, ADC has only Rx dma */            
    if ( self->devDmaRx ) {

      // Take the first interrupt to copy prio and subprio to dma channel interrupts
      const HW_IrqType *irq = self->devIrqList->irq;

      /*make sure, that also interrupts are configured, MA won't work without */
      if ( self->devIrqList->num == 0 ) {
         #if DEBUG_MODE > 0 && DEBUG_ADC > 0
             DEBUG_PRINTF("Init of %s: Use of DMA requires interrupts \n", self->devName);
         #endif
         myHandle->bInitialized  = false;
         return false;
      }

      DMA_HandleTypeDef *hdma = HW_DMA_RegisterDMAChannel(self->devDmaRx);
      if ( hdma ) {
         AdcDmaChannelInit( myHandle, self->devDmaRx);
         HW_DMA_SetAndEnableChannelIrq(hdma->Instance, irq->irq_prio, irq->irq_subprio);
      }
/*
      dma = self->devDmaRx;
      if (dma ) {
         AdcDmaChannelInit( myHandle, self->devDmaRx);
         HAL_NVIC_SetPriority(self->devDmaRx->dmaIrqNum, irq->irq_prio, irq->irq_subprio);
         HAL_NVIC_EnableIRQ(self->devDmaRx->dmaIrqNum);
      }
 */ 
    }

