rainer20512/stm32-fw/common/src/dev/adc_dev.c
    return true;
}

void ADC_DeInit(const HW_DeviceType *self)
{
    ADC_AdditionalDataType *adt = ADC_GetAdditionalData(self);
    ADC_HandleTypeDef *hAdc     = &adt->myAdcHandle->hAdc;

    HAL_ADC_Stop(hAdc);

    uint32_t devIdx = GetDevIdx(self);
    GpioADCDeInitAll(devIdx, self->devGpioADC);
  
    /* disable interrupts */
    HW_SetAllIRQs(self->devIrqList, false);

    /* Disable the DMA, if used */
    if(self->devDmaRx) {
      HW_DMA_HandleDeInit(self->devDmaRx->dmaHandle);
    }
 
    /* disable ADC clock */
    ADC_ClockInit(self, false);

    adt->myAdcHandle->bInitialized  = false;
}

/******************************************************************************
 * Check, whether the system may enter Stop 2 mode. 
 * This is the case, if neither transmit nor receive are active
 *****************************************************************************/
bool ADC_AllowStop(const HW_DeviceType *self)
{
    return !LL_ADC_REG_IsConversionOngoing((ADC_TypeDef *)self->devBase);
}



static void Adc_Handle(AdcHandleT *myHandle)
{
    /* reset "conversion doen" flag, to prevent another processing */
    myHandle->bSequenceDone = false;

    for ( uint32_t i = 0; i<myHandle->seqLen; i++ )
        printf("%d ", myHandle->seqResultPtr[i]);
    puts("");
}

/******************************************************************************
 * Trigger an Vdda measuerment. The void * parameter should be
 * the ptr to the ADC which is capable of Vdda measurement
 *****************************************************************************/
void ADC_MeasureVdda ( void *arg )
{
        Adc_MeasureVdda((const HW_DeviceType *)arg);
}

/******************************************************************************
 * Actions to be taken when adc task is initialized
 * - trigger periodic conversions at seond 56
 *****************************************************************************/
void task_init_adc(void)
{
    AtSecond ( 56, ADC_MeasureVdda, (void *)&USER_ADC, "Measure Vdda");
}

/******************************************************************************
 * handler for ADC-Tasks, is only called, if a sequence is converted via DMA
 * Single conversions are always handeled vie polling
 *****************************************************************************/
void task_handle_adc(uint32_t arg)
{
    UNUSED(arg);
#if defined(ADC1) && defined(USE_ADC1)
    if ( ADC1Handle.bSequenceDone ) Adc_Handle(&ADC1Handle);
#endif
#if defined(ADC2) && defined(USE_ADC2)
    if ( ADC2Handle.bSequenceDone ) Adc_Handle(&ADC2Handle);
#endif
#if defined(ADC3) && defined(USE_ADC3)
    if ( ADC3Handle.bSequenceDone ) Adc_Handle(&ADC3Handle);
#endif
}



#if defined(ADC1) && defined(USE_ADC1)
    AdcHandleT ADC1Handle;
    static uint16_t DMAMEM adc1_dmabuf[ADC_DMABUF_SIZE];
    static DMA_HandleTypeDef hdma_adc1_rx;
    static const HW_DmaType dmarx_adc1 = { &hdma_adc1_rx, ADC1_RX_DMA };

    static const HW_GpioList_ADC gpio_adc = {
        .num  = 2,
        .gpio = { 
            ADC1CH_REFINT,
            ADC1CH_TEMPSENSOR,
/* example ADC123_CH_3, */
/* example ADC123_CH_4, */
        }
    };

    static const ADC_AdditionalDataType additional_adc1 = {
        .myAdcHandle = &ADC1Handle,
        .myDmaBuf    = adc1_dmabuf,
    };

    const HW_IrqList irq_adc1 = {
        .num = 1,
        .irq = { ADC1_IRQ },
    };

    const HW_DeviceType HW_ADC1 = {
        .devName        = "ADC1",
        .devBase        = ADC1,
        .devGpioAF      = NULL,
        .devGpioIO      = NULL,
        .devGpioADC     = &gpio_adc,
        .devType        = HW_DEVICE_ADC,
        .devData        = &additional_adc1,
        .devIrqList     = 
            #if defined(USE_ADC1) && defined(ADC1_USE_IRQ) 
                &irq_adc1,
            #else
                NULL,
            #endif
        .devDmaRx       = 
            #if defined(USE_ADC1) && defined(ADC1_USE_DMA) 
                &dmarx_adc1,
             #else
                NULL,
             #endif
        .devDmaTx       = NULL,
        .Init           = ADC_Init,
        .DeInit         = ADC_DeInit,
        .OnFrqChange    = NULL,
        .AllowStop      = ADC_AllowStop,
        .OnSleep        = NULL,
        .OnWakeUp       = NULL,
    };
#endif

#if defined(ADC3) && defined(USE_ADC3)
    AdcHandleT ADC3Handle;
    static uint16_t DMAMEM adc3_dmabuf[ADC_DMABUF_SIZE];
    static DMA_HandleTypeDef hdma_adc3_rx;
    static const HW_DmaType dmarx_adc3 = { &hdma_adc3_rx, ADC3_RX_DMA };

    static const HW_GpioList_ADC gpio_adc = {
        .num  = 2,
        .gpio = { 
            ADC3CH_REFINT,
            ADC3CH_TEMPSENSOR,
/*example */  ADC123_CH_3,
/*example */  ADC123_CH_4,
        }
    };

    static const ADC_AdditionalDataType additional_adc3 = {
        .myAdcHandle = &ADC3Handle,
        .myDmaBuf    = adc3_dmabuf,
    };

    const HW_IrqList irq_adc3 = {
        .num = 1,
        .irq = { ADC3_IRQ },
    };

    const HW_DeviceType HW_ADC3 = {
        .devName        = "ADC3",
        .devBase        = ADC3,
        .devGpioAF      = NULL,
        .devGpioIO      = NULL,
        .devGpioADC     = &gpio_adc,
        .devType        = HW_DEVICE_ADC,
        .devData        = &additional_adc3,
        .devIrqList     = 
            #if defined(USE_ADC3) && defined(ADC3_USE_IRQ) 
                &irq_adc3,
            #else
                NULL,
            #endif
        .devDmaRx       = 
            #if defined(USE_ADC3) && defined(ADC3_USE_DMA) 
                &dmarx_adc3,
             #else
                NULL,
             #endif
        .devDmaTx       = NULL,
        .Init           = ADC_Init,
        .DeInit         = ADC_DeInit,
        .OnFrqChange    = NULL,
        .AllowStop      = ADC_AllowStop,
        .OnSleep        = NULL,
        .OnWakeUp       = NULL,
    };
#endif

#endif // #if defined(USE_ADC1) || defined(USE_ADC2) || defined(USE_ADC3)



/**
  * @}
  */


